tutorials/pisoTurbinesFoam/axialFlowWindArray/constant/turbineProperties/NREL5MWRef
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

NumBl                   3;
TipRad                 63.0;
HubRad                  1.5;
UndSling                0.0;
OverHang               -5.01910;
TowerHt                87.6;
Twr2Shft                1.96256;
ShftTilt               -5.0;
PreCone               (-2.5 -2.5 -2.5);
GBRatio                97.0;
GenIner               534.116;
HubIner               115.926E3;
BladeIner             11.776047E6;
TorqueControllerType   "fiveRegion";
YawControllerType      "none";
PitchControllerType    "none";


TorqueControllerParams
{
    CutInGenSpeed           670.0;
    RatedGenSpeed          1173.7;
    Region2StartGenSpeed    871.0;
    Region2EndGenSpeed     1161.963;
    CutInGenTorque            0.0;
    RatedGenTorque           43.09355E3;
    RateLimitGenTorque       15.0E3;
    KGen                      2.55764E-2;
    TorqueControllerRelax     1.0;
}


PitchControllerParams
{
    PitchControlStartPitch    0.0;
    PitchControlEndPitch      7.6;
    PitchControlStartSpeed    15.77;
    PitchControlEndSpeed      16.0;
    RateLimitPitch             4.5;
}



Airfoils
(
    "Cylinder1" 
    "Cylinder2" 
    "DU40_A17"  
    "DU35_A17"  
    "DU30_A17"  
    "DU25_A17"  
    "DU21_A17"  
    "NACA64_A17"
);


BladeData
(
//  radius(m)   c(m)     twist(deg) airfoil 
    (2.8667     3.542    13.308     0)
    (5.6        3.854    13.308     0)
    (8.3333     4.167    13.308     1)
    (11.75      4.557    13.308     2)
    (15.85      4.652    11.48      3)
    (19.95      4.458    10.162     3)
    (24.05      4.249    9.011      4)
    (28.15      4.007    7.795      5)
    (32.25      3.748    6.544      5)
    (36.35      3.502    5.361      6)
    (40.45      3.256    4.188      6)
    (44.55      3.01     3.125      7)
    (48.65      2.764    2.319      7)
    (52.75      2.518    1.526      7)
    (56.1667    2.313    0.863      7)
    (58.9       2.086    0.37       7)
    (61.6333    1.419    0.106      7)
);
